#program was written 15.09.22 at home by Igor B.

a =int(input())
print(a%7+3)

'Дни недели пронумерованы как: 0 - воскресенье, 1 - понедельник, ..., 6 - суббота. Целое число N имеет значение в диапазоне от 1 до 365\
Найдите число дня недели для N-ого дня исходя из условия, что 1 января был четверг'