a =input()
print(a.count(' ') + 1)

"Дана строка, состоящая из слов, разделенных пробелами. Определите, сколько слов имеет данная строка"